name: "Decoder"
input: "ip"
input_shape { dim: 64 dim: 20 }
input: "label"
input_shape { dim: 64 dim: 1 }
layer {
  name: "ip2"
  type: "InnerProduct"
  bottom: "ip"
  top: "ip2"
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "loss"
  type: "EuclideanLoss"
  bottom: "ip2"
  bottom: "label"
  top: "loss"
}
